Terraform plan shows force replacement for these createOnlyProperties:

```
  # awscc_ec2_ipam_pool.example must be replaced
-/+ resource "awscc_ec2_ipam_pool" "example" {
      + allocation_default_netmask_length = (known after apply)
      + allocation_max_netmask_length     = (known after apply)
      + allocation_min_netmask_length     = (known after apply)
      + allocation_resource_tags          = (known after apply)
      ~ arn                               = "arn:aws:ec2::204034886740:ipam-pool/ipam-pool-0503a8371a95ab7d3" -> (known after apply)
      ~ auto_import                       = false -> (known after apply)
      + aws_service                       = (known after apply) # forces replacement
      ~ description                       = "example pool" -> "example pool longer"
      ~ id                                = "ipam-pool-0503a8371a95ab7d3" -> (known after apply)
      ~ ipam_arn                          = "arn:aws:ec2::204034886740:ipam/ipam-07f64eb9d3be41299" -> (known after apply)
      ~ ipam_pool_id                      = "ipam-pool-0503a8371a95ab7d3" -> (known after apply)
      ~ ipam_scope_arn                    = "arn:aws:ec2::204034886740:ipam-scope/ipam-scope-00e0e4271731e525b" -> (known after apply)
      ~ ipam_scope_type                   = "private" -> (known after apply)
      ~ pool_depth                        = 1 -> (known after apply)
      + provisioned_cidrs                 = (known after apply)
      + public_ip_source                  = (known after apply) # forces replacement
      + publicly_advertisable             = (known after apply) # forces replacement
      + source_ipam_pool_id               = (known after apply) # forces replacement
      + source_resource                   = (known after apply) # forces replacement
      ~ state                             = "create-complete" -> (known after apply)
      ~ state_message                     = "None" -> (known after apply)
      + tags                              = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```